Repository: NaN-tic/trytond-working_shift_contract
Catalog: locale/*.po
Languages: ca

# error:working_shift.contract.field:
source: The Contract + Field tuple of the Working Shift Contract Field must be unique.
ca: La parella Contracte i Camp dels camps dels contractes de torns de treballs ha de ser única.

# error:working_shift.contract:
source: Start time can't be less of end time.
ca: L’hora d’inici no pot ser inferior a l’hora de finalització.

# error:working_shift.intervention:
source: The field "%(field)s" of Working Shift Intervention "%(intervention)s" is required because of the shift's contract.
ca: El camp "%(field)s" de la intervenció "%(intervention)s" és requerit degut al contracte del torn de treball.

# error:working_shift.intervention:
source: The product "%s" used to invoice interventions doesn't have Revenue Account.
ca: El producte "%s" utilitzat per facturar intervencions no té compte d'ingresos.

# error:working_shift:
source: The product "%s" used to invoice working shifts doesn't have Revenue Account.
ca: El producte "%s" utilitzat per facturar torns de treball no té compte d'ingresos.

# error:working_shift:
source: You can't not assign the employee "%(employee)s" to the working shift "%(working_shift)s" because he is already assigned to the working shift "%(conflictive_working_shift)s" with the same time interval.
ca: No pots assignar l'empleat "%(employee)s" al torn de treball "%(working_shift)s" perquè aquest ja està assignat al torn de treball "%(conflictive_working_shift)s" amb el mateix interval de temps.

# error:working_shift:
source: You cannot cancel the working shift "%s" because it is already invoiced.
ca: No pot cancel·lar el torn de treball "%s" perquè ja està facturat.

# error:working_shift:
source: You cannot cancel the working shift "%s" because some of its interventions are already invoiced.
ca: No pot cancel·lar el torn de treball "%s" perquè alguna de les seves intervencions ja estan facturades.

# field:account.invoice.line,interventions:
source: Interventions
ca: Intervencions

# field:account.invoice.line,working_shifts:
source: Working Shifts
ca: Torns de treball

# field:working_shift.center,create_date:
source: Create Date
ca: Data de creació

# field:working_shift.center,create_uid:
source: Create User
ca: Usuari de creació

# field:working_shift.center,name:
source: Name
ca: Nom

# field:working_shift.center,rec_name:
source: Name
ca: Nom

# field:working_shift.center,write_date:
source: Write Date
ca: Data de modificació

# field:working_shift.center,write_uid:
source: Write User
ca: Usuari de modificació

# field:ir.model.field,model_model:
source: Model Name
ca: Nom del model

# field:ir.model.field,working_shift_contract_managed:
source: Contract Managed
ca: Gestionat al contracte

# field:working_shift,contract:
source: Contract
ca: Contracte

# field:working_shift,customer_contract_rule:
source: Customer Contract Rule
ca: Regla contracte empleat

# field:working_shift,customer_invoice_line:
source: Customer Invoice Line
ca: Línia de factura de client

# field:working_shift,date:
source: Date
ca: Data

# field:working_shift,estimated_end:
source: Estimated End Time
ca: Hora de fi teòrica

# field:working_shift,estimated_hours:
source: Estimated Hours
ca: Hores estimades

# field:working_shift,estimated_start:
source: Estimated Start Time
ca: Hora de inici teòrica

# field:working_shift,requires_interventions:
source: Requires Interventions
ca: Requereix intervencions

# field:working_shift.contract,center:
source: Center
ca: Centre

# field:working_shift.contract,create_date:
source: Create Date
ca: Data creació

# field:working_shift.contract,create_uid:
source: Create User
ca: Usuari creació

# field:working_shift.contract,end_time:
source: End Time
ca: Hora fi

# field:working_shift.contract,id:
source: ID
ca: Identificador

# field:working_shift.contract,intervention_fields:
source: Intervention Fields
ca: Camps intervencions

# field:working_shift.contract,intervention_rules:
source: Intervention Rules
ca: Regles per intervencions

# field:working_shift.contract,invoicing_method:
source: Invoicing Method
ca: Mètode de facturació

# field:working_shift.contract,name:
source: Name
ca: Nom

# field:working_shift.contract,party:
source: Party
ca: Tercer

# field:working_shift.contract,rec_name:
source: Name
ca: Nom

# field:working_shift.contract,requires_interventions:
source: Requires Interventions
ca: Requereix intervencions

# field:working_shift.contract,start_time:
source: Start Time
ca: Hora inici

# field:working_shift.contract,working_shift_rules:
source: Working Shift Rules
ca: Regles per torns de treball

# field:working_shift.contract,write_date:
source: Write Date
ca: Data modificació

# field:working_shift.contract,write_uid:
source: Write User
ca: Usuari modificació

# field:working_shift.contract.field,contract:
source: Contract
ca: Contracte

# field:working_shift.contract.field,create_date:
source: Create Date
ca: Data creació

# field:working_shift.contract.field,create_uid:
source: Create User
ca: Usuari creació

# field:working_shift.contract.field,field:
source: Field
ca: Camp

# field:working_shift.contract.field,id:
source: ID
ca: Identificador

# field:working_shift.contract.field,rec_name:
source: Name
ca: Nom

# field:working_shift.contract.field,required:
source: Required
ca: Requerit

# field:working_shift.contract.field,write_date:
source: Write Date
ca: Data modificació

# field:working_shift.contract.field,write_uid:
source: Write User
ca: Usuari modificació

# field:working_shift.contract.intervention_rule,contract:
source: Contract
ca: Contracte

# field:working_shift.contract.intervention_rule,create_date:
source: Create Date
ca: Data creació

# field:working_shift.contract.intervention_rule,create_uid:
source: Create User
ca: Usuari creació

# field:working_shift.contract.intervention_rule,end_date:
source: End Date
ca: Data final

# field:working_shift.contract.intervention_rule,hours:
source: Hours
ca: Hores

# field:working_shift.contract.intervention_rule,id:
source: ID
ca: Identificador

# field:working_shift.contract.intervention_rule,list_price:
source: List Price
ca: Preu de venda

# field:working_shift.contract.intervention_rule,name:
source: Name
ca: Nom

# field:working_shift.contract.intervention_rule,product:
source: Product
ca: Producte

# field:working_shift.contract.intervention_rule,rec_name:
source: Name
ca: Nom

# field:working_shift.contract.intervention_rule,sequence:
source: Sequence
ca: Seqüència

# field:working_shift.contract.intervention_rule,start_date:
source: Start Date
ca: Data inicial

# field:working_shift.contract.intervention_rule,write_date:
source: Write Date
ca: Data modificació

# field:working_shift.contract.intervention_rule,write_uid:
source: Write User
ca: Usuari modificació

# field:working_shift.contract.working_shift_rule,contract:
source: Contract
ca: Contracte

# field:working_shift.contract.working_shift_rule,create_date:
source: Create Date
ca: Data creació

# field:working_shift.contract.working_shift_rule,create_uid:
source: Create User
ca: Usuari creació

# field:working_shift.contract.working_shift_rule,end_date:
source: End Date
ca: Data final

# field:working_shift.contract.working_shift_rule,hours:
source: Hours
ca: Hores

# field:working_shift.contract.working_shift_rule,id:
source: ID
ca: Identificador

# field:working_shift.contract.working_shift_rule,list_price:
source: List Price
ca: Preu de venda

# field:working_shift.contract.working_shift_rule,name:
source: Name
ca: Nom

# field:working_shift.contract.working_shift_rule,product:
source: Product
ca: Producte

# field:working_shift.contract.working_shift_rule,rec_name:
source: Name
ca: Nom

# field:working_shift.contract.working_shift_rule,sequence:
source: Sequence
ca: Seqüència

# field:working_shift.contract.working_shift_rule,start_date:
source: Start Date
ca: Data inicial

# field:working_shift.contract.working_shift_rule,write_date:
source: Write Date
ca: Data modificació

# field:working_shift.contract.working_shift_rule,write_uid:
source: Write User
ca: Usuari modificació

# field:working_shift.intervention,contract:
source: Contract
ca: Contracte

# field:working_shift.intervention,customer_contract_rule:
source: Customer Contract Rule
ca: Regla contracte empleat

# field:working_shift.intervention,customer_invoice_line:
source: Invoice Line
ca: Línia de factura

# field:working_shift.intervention,invoicing_method:
source: Invoicing Method
ca: Mètode de facturació

# field:working_shift.invoice_customers.dates,end_date:
source: End Date
ca: Data final

# field:working_shift.invoice_customers.dates,id:
source: ID
ca: Identificador

# field:working_shift.invoice_customers.dates,start_date:
source: Start Date
ca: Data inicial

# help:ir.model.field,working_shift_contract_managed:
source: If checked, this field will be available in the list of fields to be configured per Working Shift Contracts.
ca: Si està marcat aquest camp estarà disponible al llistat de camps a configurar per contracte de torn de treball.

# help:working_shift.contract,requires_interventions:
source: A Working Shift in a contract which requires interventions will show the user a warning if he closes it without creating any intervention.
ca: Un torn de treball en un contracte que requreix intervencions mostrarà a l'usuari un avís si el tanca sense crear cap intervenció.

# help:working_shift.contract.intervention_rule,hours:
source: If it is set, this rule will be used to invoice only when the hours are less or equal than this value.
ca: Si s'estableix, aquesta regla s'utilitzarà per facturar únicament quan les hores siguin menors o igual a aquest valor.

# help:working_shift.contract.intervention_rule,list_price:
source: Price per hour to use when invoice to customers.
ca: Preu per hora que s'utilitzarà when es facturi als clients

# help:working_shift.contract.working_shift_rule,hours:
source: If it is set, this rule will be used to invoice only when the hours are less or equal than this value.
ca: Si s'estableix, aquesta regla s'utilitzarà per facturar únicament quan les hores siguin menors o igual a aquest valor.

# help:working_shift.contract.working_shift_rule,list_price:
source: Price per hour to use when invoice to customers.
ca: Preu per hora que s'utilitzarà when es facturi als clients

# model:working_shift.center,name:
source: Center
ca: Centre

# model:ir.action,name:
source: Working Shift Calendar
ca: Agenda de Torns de treball

# model:ir.action,name:act_center
source: Centers
ca: Centres

# model:ir.action,name:act_contract
source: Customer Contracts
ca: Contractes de client

# model:ir.action,name:act_invoice_customers
source: Invoice Customers
ca: Factura clients

# model:ir.ui.menu,name:
source: Working Shift Calendar
ca: Agenda de Torns de treball

# model:ir.ui.menu,name:menu_center
source: Centers
ca: Centres

# model:ir.ui.menu,name:menu_center_list
source: Centers
ca: Centres

# model:ir.ui.menu,name:menu_contract
source: Customer Contracts
ca: Contractes de client

# model:ir.ui.menu,name:menu_invoice_customers
source: Invoice Customers
ca: Factura clients

# model:res.group,name:group_center
source: Center
ca: Centre

# model:res.group,name:group_center_admin
source: Centers Administration
ca: Administració de Centres

# model:res.group,name:group_working_shift_contract
source: Working Shifts Contracts
ca: Contractes torns de treball

# model:working_shift.contract,name:
source: Working Shift Contract
ca: Contracte torn de treball

# model:working_shift.contract.field,name:
source: Working Shift Contract Field
ca: Camp contracte torn de treball

# model:working_shift.contract.intervention_rule,name:
source: Working Shift Contract Intervention Rule
ca: Regla contracte per intervencions

# model:working_shift.contract.working_shift_rule,name:
source: Contract Working Shift Rule
ca: Regla contracte per torns de treball

# model:working_shift.invoice_customers.dates,name:
source: Working Shift Invoice Customers Dates
ca: Dates facturació clients torn de treball

# selection:working_shift.center,color:
source: Green
ca: Verd

# selection:working_shift.center,color:
source: Navy Blue
ca: Blau marí

# selection:working_shift.center,color:
source: Orange
ca: Taronja

# selection:working_shift.center,color:
source: Red
ca: Vermell

# selection:working_shift.center,color:
source: Soft Blue
ca: Blau clar

# selection:working_shift.center,color:
source: White
ca: Blanc

# selection:working_shift.center,color:
source: Yellow
ca: Groc

# selection:working_shift.contract,invoicing_method:
source: Interventions
ca: Intervencions

# selection:working_shift.contract,invoicing_method:
source: Working Shifts
ca: Torns de treball

# view:account.invoice.line:
source: Working Shifts & Interventions
ca: Torns de treball & Intervencions

# view:working_shift.center:
source: Centers
ca: Centres

# view:working_shift.center:
source: Working Shift
ca: Torn de treball

# view:working_shift.contract.field:
source: Contract Field
ca: Camp contracte

# view:working_shift.contract.intervention_rule:
source: Conditions
ca: Condicions

# view:working_shift.contract.intervention_rule:
source: Contract Intervention Rule
ca: Regla contracte per intervencions

# view:working_shift.contract.intervention_rule:
source: Contract Intervention Rules
ca: Regles contracte per intervencions

# view:working_shift.contract.intervention_rule:
source: Result
ca: Resultat

# view:working_shift.contract.working_shift_rule:
source: Conditions
ca: Condicions

# view:working_shift.contract.working_shift_rule:
source: Contract Working Shift Rule
ca: Regla contracte per torns de treball

# view:working_shift.contract.working_shift_rule:
source: Contract Working Shift Rules
ca: Regles contracte per torns de treball

# view:working_shift.contract.working_shift_rule:
source: Result
ca: Resultat

# view:working_shift.contract:
source: Customer Contract
ca: Contracte de client

# view:working_shift.contract:
source: Customer Contracts
ca: Contractes de client

# view:working_shift.contract:
source: Rules
ca: Regles

# view:working_shift.invoice_customers.dates:
source: Create customer invoices for working shifts in this period
ca: Crea factures de client pels torns de treball en aquest període.

# view:working_shift.invoice_customers.dates:
source: Invoice Working Shift Customers
ca: Factura torns de treballs a clients

# view:working_shift:
source: Working Shifts
ca: Torns de treball

# wizard_button:working_shift.invoice_customers,dates,end:
source: Cancel
ca: Cancel·la

# wizard_button:working_shift.invoice_customers,dates,invoice:
source: Invoice
ca: Factura
